'''Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
Примеры
список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
список: [], ищем: "123", ответ: -1'''

#list_01 = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
#list_02 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
#list_03 = ["йцу", "фыв", "ячс", "цук", "йцукен"]
#list_04 = ["123", "234", 123, "567"]



#test_list = str(input("Введите список из вариантов: "))

list_1 = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
print(f"список: {list_1}")
x = str(input("Введите искомую строку: "))


def check_list(list_1, x):
    count = 0
    for i in range(len(list_1)):
        if list_1[i] == x:
            count += 1
            if count == 2:
                return i
    else:
        return -1


print(f"ответ: {check_list(list_1, x)}")